The  DimensionEqualityLabelFormatting  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LabelType
 label type for the parameter
LeadingSpaces
 leading spaces before the parameter
Prefix
 prefix for the parameter
Suffix
 suffix for the parameter
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace